---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.Clear
source: html/68716659-1855-8adc-40fe-df3931195993.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.Clear Method

Removes every curve from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```